//categories
export const BLEEDING = 1;
export const VAGINAL = 2;
export const PAIN = 3;
export const MOOD = 4;
export const SLEEP = 5;
export const EXCERSICE = 6;
export const SEX = 7;

export const OPTIONS = {
  //BLEEDING
  SPOTTING: 1,
  LIGHT: 2,
  MEDIUM: 3,
  HEAVY: 4,

  //PAIN
  HEADACHE: 5,
  BREASTS: 6,
  CRAMPS: 7,
  BACKACHE: 8,

  //VAGINAL
  STICKY: 9,
  CREAMY: 10,
  EGGWHITE: 11,
  ABNORMAL: 12,

  //MOOD
  HAPPY: 13,
  NEUTRAL: 14,
  SAD: 15,
  PMS: 16,

  //SLEEP
  NO_SLEEP: 17,
  LITTLE_SLEEP: 18,
  AVERAGE_SLEEP: 19,
  LOTS_SLEEP: 20,

  //EXCERSICE
  EXERCISE1: 21,
  EXERCISE2: 22,
  EXERCISE3: 23,
  EXERCISE4: 24,

  //SEX
  PROTECTED_SEX: 25,
  UNPROTECTED_SEX: 26,
};

//more details
export const MORE_ABOUT_BLEEDING = `خونریزی:

قاعدگی یا پریودی، خونریزی طبیعی بدن شماست که به عنوان بخشی از چرخه‌ی ماهانه یک زن اتفاق می‌افتد. هرماه بدن شما برای بارداری آماده می‌شود و اگر بارداری رخ ندهد، دیواره‌ی رحم ریزش می‌کند و از طریق واژن از بدن خارج می‌شود که به آن خونریزی قاعدگی یا در احکام اسلامی حیض می‌گویند.

و طول هر دوره پریودی معمولاً ۴تا ۶ روز می‌باشد و به صورت منظم هر ۲۱ تا ۳۵ روز یکبار شروع می‌شود.

قاعدگی در سنین باروری از سن ۱۱ تا ۱۴سالگی (بلوغ) شروع می‌شود  و معمولاً تا 50 سالگی (یائسگی) ادامه دارد.


با درنظر گرفتن سه شاخص زیر می‌توانید اطلاعات بهتری درمورد پریودتان بدست آورید:

۱-حجم خون :

حجم خونریزی پریودی در سه روز اول به مراتب بیشتر است و باید تا سه روز متوالی و به صورت پیوسته ادامه داشته باشد و سپس کاهش می‌یابد.(به این معنی که در طول شبانه روز واژن شما آغشته به خون باشد.) که در غیر این شرایط نمی توان آن خونریزی را جزو خونریزی قاعدگی به حساب آورد. برای اطلاع از میزان حجم خونریزی می‌توانید تعداد نواربهداشتی یا محصولات قاعدگی که روزانه استفاده می‌کنید را شمارش کنید.


۲-مدت زمان و طول دوره :

حداقل خونریزی پریود 3 روز متوالی و حداکثر طول دوره خونریزی 10 روز است که از روز سوم تا دهم وجود استمرار و توالی شرط نیست.بازه زمانی متداول برای دوره ی خونریزی پریود بین 4 تا 6 روز است. همچنین فاصله و مدت طبیعی زمان پاکیزگی از خون، بین دو دوره پریود، باید حداقل 10 روز کامل باشد. که غالبا شکل طبیعی آن بطور متوسط بین 21-35 روز است.

مشخص بودن مدت زمان و طول دوره‌ پریودی به شما و کارشناس احکام و همچنین پزشکتان در تشخیص خونریزی های غیر معمول از پریود برای تشخیص تکیلف عبادت های واجب، شناخت بهتر مشکلات و بیماری‌ها و محدوده‌ی سلامت شما کمک می‌کند.


۳-ویژگی های خون : 

خون قاعدگی در بیشتر اوقات غلیظ، گرم و تازه است و رنگ آن سرخ یا سرخ تیره مایل به سیاه است و با فشار و کمی سوزش بیرون می آید. شناخت این ویژگی ها در ابتدای دوره قاعدگی به شما کمک می کند تا بتوانید بفهمید که واقعا پریود شده اید یا خیر !  رنگ خون قاعدگی ممکن است در طول پریودی تغییر کند و شما متوجه خون تیره در روز‌های آخر پریودتان شوید که معنی این خون تیره‌تر این است که این خون قدیمی‌تر است و مدت زمان بیشتری طول کشیده تا از رحم خارج شود.

 نکته مهم:

در موارد یائسگی، اختلالات هورمونی و نامنظمی قاعدگی، و یا تحت تاثیر بیماری های دیگر، خونریزی های منقطع با شدت و ضعف های متفاوت (لک بینی و یا غیر از آن) ممکن است ایجاد شوند.

عوامل موثر در برهم خوردن نظم قاعدگی :

    افرادی که به تازگی چرخه‌ قاعدگی آن‌ها شروع شده است.
    افرادی که نزدیک به یائسگی هستند.
    استرس و اضطراب
    حاملگی
    ورزش سنگین
    افزایش یا کاهش وزن شدید
    کم خونی
    سقط جنین
    عفونت‌ها
    بسیاری از مشکلات دستگاه تولید‌مثل( برای مثال فیبروم رحم یا تخمدان پلی کیستیک)


دیدار با پزشک زنان یا ماما در صورت...

    معمولاً پریودی‌های بیش از ۷ روز دارید.
    شروع پریودی‌‌های شما معمولاً کمتر از ۲۱ روز یا بیش از ۳۵ روز است.
    خونریزی زیادی دارید و معمولاً باید نواربهداشتی خود را هر ۲-۱ ساعت تعویض کنید.
    معمولاً لخته‌های خون با قطر ۲/۵سانتی‌متر مشاهده می‌کنید.
    در طول ۹۰ روز گذشته پریود نشده‌اید و باردار هم نیستید.
    تغییرات محسوسی از جمله میزان درد،حجم خونریزی و طول مدت پریود دارید که نگران شده‌اید.
    معمولاً بین دوره‌های پریودتان خونریزی دارید و یا خونریزی‌های سنگین و نامعمول را بین دوره‌های نرمال قاعدگی تجربه می‌کنید.

یکی از نکات مهم اینکه اگر درد شکمی شدید همراه با سرگیجه یا غش و ضعف دارید و با فشار بر روی شکم دچار درد می‌شوید بهتر است. سریعاً به پزشک مراجعه کنید زیرا نشانه‌هایی از حاملگی خارج از رحم می‌باشد و از طرفی حاملگی خارج از رحم می‌تواند کشنده باشد.


انواع خونریزی:

 

    سنگین : سنگین‌ترین خونریزی‌ها در روزهای اول پریودی اتفاق می‌افتد ولی خونریزی شدید و سنگین در طول دوره قاعدگی می‌تواند به دلایل زیادی ایجاد شود که مهم‌ترین آن‌ها: مشکلات انعقاد خون، پولیپ رحمی، آندومتریوزیس و به ندرت تومورها هستند.

البته گفتنی است که توصیف هر فرد در مورد خونریزی شدید با دیگری فرق دارد، آشنا بودن با خونریزی معمولی خودتان برای فهمیدن هرگونه تغییری در آن مهم است.

    متوسط : خونریزی متوسط هنگامی که خونریزی شما نسبت به خونریزی شدید روزهای اولیه کاهش پیدا می‌کند و برای مثال ممکن است شما یک نواربهداشتی را هر ۳ساعت تعویض کنید.

 بازهم باید گفت که توصیف هر فرد در مورد خونریزی متوسط با دیگری فرق دارد، آشنا بودن با خونریزی معمولی خودتان برای فهمیدن هرگونه تغییری در آن مهم است.

    خفیف : در شروع و پایان خونریزی شما خفیف می‌باشد.یعنی بیشتر از ۳ساعت طول می‌کشد که یک نواربهداشتی را خیس و تعویض کنید.

بازهم باید گفت که توصیف هر فرد در مورد خونریزی خفیف با دیگری فرق دارد، آشنا بودن با خونریزی معمولی خودتان برای فهمیدن هرگونه تغییری در آن مهم است.

    لکه بینی: دوره‌های لکه‌بینی معمولا کوتاه‌تر از دوره‌ی پریود شما و زیر سه روز هستند. اگر خونریزی شما صوتی روشن و یا قهوه ای کم رنگ ( فاقد ویژگی های خون که در بالا گفته شد) است می توانید این گذینه را انتخاب کنید. بعضی افراد معمولا در حوالی روز تخمک گذاری لکه های خون ترشح میکنند. و لکه‌بینی در افرادی که از بعضی راه های پیشگیری از بارداری هورمونی استفاده میکنند هم شایع است.

پیگیری لکه بینی ها به شما کمک میکند که تشخیص دهید که آیا این یک مرحله ی عادی از دوره ی شماست یا نه؟ اگر یک پریود نامنظم دارید ، خونریزی شما زودتر از انتظارتان اتفاق می‌افتد ، یا اگر از راه های هورمونی پیشگیری از بارداری استفاده میکنید ، ممکن است تشخیص بین لکه ها با پریود واقعی برایتان سخت باشد (مخصوصا اگر خونریزی شما در اوایل پریود بصورت سبک و خفیف است)

در این شرایط برای آرامش خیال در مورد انجام تکلیف عبادی خود می توانید با مراجعه به صفحه ی احکام در مورد نخوه ی تشخیص خون ریزی حیض و استحاضه بیشتر بدانید و یا به طور شبانه روزی با کارشناس فقهی خانم، ارتباط تلفنی برقرار کنید.`;
export const MORE_ABOUT_VAGINAL = `

ترشحات:

ترشحات واژن عملکرد طبیعی دستگاه تولیدمثل زنان است. بیشتر اوقات ترشحات واژن کاملا طبیعی هستند و باتوجه به زمان چرخه هورمونی، میزان و رنگ و بوی آنها متفاوت است.

به عنوان مثال در هنگام تخمک گذاری، شیردهی ویا هنگام نزدیکی ممکن است ترشحات بیشتری داشته باشید. که هیچ یک زنگ خطر محسوب نمیشود، اما اگر رنگ و بو و قوام کاملا متفاوت تر از حد معمول باشد بخصوص اگر همزمان دچار شرایط غیر معمول از جمله :

    خارش و سوزش واژن
    درد هنگام نزدیکی
    درد و خارش هنگام ادرار کردن
    درد شکم و لگن
    بوی نامطبوع ترشحات(بوی ماهی و ...)
    تغییر رنگ ترشحات(خاکستری، زرد یا مایل به سبز)
    تغییر بافت ترشحات(مثلا دارای تکه های بزرگ، پنیری،کف آلود)
    بی اختیاری ادرار
    تب و لرز
    استفراغ

هستید، به پزشک مراجعه کنید زیرا ممکن است دچار عفونت یا بیماری های دیگری شده باشید.

  

انواع ترشحات طبیعی:

سفید- تخم مرغی: کشسان، لغزنده، خیس، نیمه شفاف و مثل سفیده تخم مرغ نپخته

اصطلاح سفیده تخم مرغی در بسیاری از روش های آگاهی از باروری برای توصیف بارورترین ترشحات واژینال که در حوالی روز تخمک گذاری و روز تخمک گذاری مشاهده میشود ، استفاده میشود.

چسبنده: چسبنده و لاستیک مانند اما خیس نیست.

پروژسترون هورمون غالب در نیمه دوم چرخه قاعدگی از روز تخمک گذاری تا شروع پریود بعدی است(فاز لوتئال نام دارد.) برخلاف استروژن، که باعث خیس تر شدن ترشحات واژینال میشود، پروژسترون باعث چسبنده و صمغی شدن ترشحات میشود. به همین دلیل ممکن است ترشحات صمغ مانند یا چسبنده را بعد از تخمک گذاری تا شروع پریود بعدی تجربه کنید.برخلاف ترشحات لغزنده ای که معمولا حوالی تخمک گذاری دیده میشوند و نشان از باروری دارند، ترشحات واژینال چسبنده، پذیرای اسپرم نیستند.

کرمی : نرم و لطیف، ممکن است آبکی و رقیق باشد.

اصطلاح کرمی در بسیاری از روش های آگاهی از باروری برای توصیف ترشحاتی به کار میرود که ویژگی های نزدیکی به ترشحات بارور دارند اما هنوز به آن ترشحات نرسیده اند. ممکن است ترشحات کرمی را چند روز بعد از پریود و تا زمان پیش از تخمک گذاری مشاهده کنید ( اواسط فاز فولیکولار).سطح استروژن در این قسمت از چرخه افزایش می یابد ، و استروژن محتوای آب ترشحات واژینال را افزایش میدهد.

عواملی که باعث تغییر ترشحات میشوند:

    آنتی بیوتیک ها
    قرص های ضدبارداری
    عفونت های مقاربتی
    عفونت های زنان
    عفونت های ادراری
    بیماری التهابی لگن PID
    سوزاک
    دیابت
    سرطان

پس در صورتی که هرنوع تغییری در ترشحات طبیعی واژینال خود احساس کردید باید به پزشک مراجعه کنید و پزشک بعد از معاینه در صورت صلاحدید یا تشخیص عفونت دارو درمانی را شروع میکند و در بعضی موارد آزمایش و سونوگرافی درخواست داده میشود.
`;
export const MORE_ABOUT_PAIN = `درد

درد یک احساس ناخوشایند، یک تجربه عاطفی و ناراحتی فیزیکی است. ممکن است مثل خراش ، تیر کشیدن ، سوزش و نیش حس شود.

درد پاسخ محافظتی بدن در برابر آسیب هاست.

هر خانمی ممکن است علائم درد را در زمان های خاصی از چرخه ماهانه خود تجربه کند.

درد در  مرحله قبل از قاعدگی شایع است ، مخصوصا درد سینه در صورت لمس ، کمردرد و سردرد . اگر شما علائم پیش از قاعدگی را تجربه میکنید ، نوع علائم و زمان آنها معمولا همیشه همانطور باقی میماند اما شدت آنها از چرخه ای به چرخه ی دیگر ممکن است متفاوت باشد. بررسی درد در کل طول چرخه و برای چند چرخه می تواند به شما کمک کند علائم خود را تعیین کنید و بشناسید و اگر هرکدام از این علائم بیشتر شد متوجه شوید، توجه به شدت درد هم مهم است.ممکن است بتوانید دلیل افزایش علائم یا افزایش شدت آنها را شناسایی کنید و اثربخشی راه های تسکین علائم را متوجه شوید (از قرص ایبوپروفن ،پد گرم کننده تا حمام آب گرم) هم چنین آشنا شدن با علائم درد در چرخه ی ماهانه تان یک مرجع و منبع مهم برای وقتی ست که فکر میکنید مشکلی پیش آمده.

در مورد سندرم پیش از قاعدگی اطلاعاتی دارید؟

سندرم پیش از قاعدگی مجموعه ای از علائم فیزیکی ، رفتاری و خلق و خویی است که قبل و حین پریود تشدید میشود و زندگی یک فرد را تحت تاثیر منفی قرار میدهد. علائم درد مثل لمس دردناک سینه ها ، بدن درد و سردرد شایع هستند .آمار ها و تخمین ها متفاوت هستند ، اما 20 تا 32 درصد افرادی که قاعدگی دارند ، سندرم پیش از قاعدگی ملایم و 3 تا 8 درصد سندرم پیش از قاعدگی شدید را تجربه می کنند.

به پزشک مراجعه کنید اگر ...

    درد شما آنقدر شدید است که زندگی روزانه ی شما را مختل کند یا تغییر محسوسی در شدت آنها در طول چرخه های قاعدگی ایجاد شده است.
    درد شکم شما به شکل غیر معمولی شدید است و بیشتر از 2 تا 3 روز طول می کشد.
    سردرد های قاعدگی یا میگرن زندگی شما را سخت کرده است.
    درد سینه ی شما به صورت محسوسی تغییر می کند ، روی زندگی عادی شما تاثیر می گذارد یا برای بیشتر از 3 هفته طول می کشد .

انواع درد

    گرفتگی عضلات: درد ناشی از انقباض عضلات رحم که ممکن است در قسمت پایینی کمر و ران ها هم حس شود. گرفتگی های عضلانی دردهای شایعی هستند که در روزهای قبل و حین پریود اتفاق می افتند. دانشمندان گمان می کنند دلیل این گرفتگی ها افزایش پروستاگلاندین است.پروستاگلاندین ماده ای هورمون مانند است که در ریزش لایه ی درونی رحم به آن کمک میکند.

راه حل

 دارو های ضد التهابی و مسکن (غیر استروئیدی) تولید پروستاگلاندین را متوقف میکنند و اثر ضد دردی خوبی روی گرفتگی های عضلانی از خود نشان داده اند. با این حال استفاده از این داروها عوارض جانبی خاص خود را دارند ، پس با مشورت و طبق دستور دکتر خود استفاده کنید تا مطمئن شوید این داروها درمان خوبی برای شما هستند یا نه.

همچنین شواهد زیادی برای راه های درمانی غیردارویی دردهای مرتبط با چرحه هورمونی وجود دارد. گرما (مثلا گرمای پدهای گرم کننده یا پوشانیدن خود) هم اثرات مفید خود را برای تسکین درد نشان داده. علاوه بر این موارد ، گیاهان دارویی ، ورزش ، تغییر رژیم غذایی و طب سوزنی هم مورد مطالعه قرار گرفته اند.نتایج قابل قبولی مشاهده شده اما تحقیقات بیشتری لازم است.

    سردرد: سردردها در دوران پیش از قاعدگی و در حین آن شایع هستند.گفته شده که پروستاگلاندین ها – مواد هورمون مانندی که در لایه ریزی رحم نقش دارند – در این درد نقش دارند. میگرن ها سردرد های شدیدی هستند که ممکن است با درد ضربان دار، حساسیت به نور و صدا ، حالت تهوع و استفراغ همراه باشند. بیشتر افرادی که میگرن دارند ، همراهی قاعدگی و میگرن با هم را گزارش کرده اند. همچنین ، افراد دارای میگرن تغییراتی را در میگرن خود در طول زندگی گزارش کرده اند. مثلا تغییراتی مربوط به اولین قاعدگی ، مصرف دارهای ضدبارداری خوراکی ، بارداری یا یائسگی .

گفته شده که تغییرات سطح استروژن باعث این تغییرات میشوند. مصرف استروژن اضافی (روش های هورمونی پیشگیری از بارداری و هورمون درمانی جایگزین) میگرن را بدتر میکنند. پیگیری و دنبال کردن میگرن در ارتباط با چرخه ی شما ، به پزشکتان کمک میکند که تصمیم بگیرد کدام درمان برای شما بیشترین کارایی را دارد.

راه حل

دارو های ضد التهابی و مسکن (غیر استروئیدی)، داروهای شایع بدون نسخه ای برای سردرد و میگرن هستند.همچنین نسخه های دارویی زیادی برای میگرن وجود دارد که اگر میگرن یا سردرد شدید با دکتر خود صحبت کنید و بهترین روش درمان را بیابید.

    درد تخمک گذاری: دردی در پایین شکم که نشان دهنده ی تخمک گذاری است. نزدیک زمان تخمک گذاری ، بسیاری از افراد درد تخمک گذاری را حس میکنند که یک درد تیز یا گرفتگی مانند در یک طرف یا در قسمت پایینی شکم است. میتواند ناگهان شروع شود و  بعد از چند ساعت فروکش کند ، یا میتواند برای چند روز ادامه داشته باشد. تشخیص درد تخمک گذاری میتواند راهنمای خوبی برای برای زمان تخمک گذاری و اقدام به بارداری شما باشد.

راه حل

دارو های ضد التهابی و مسکن (غیر استروئیدی) تولید پروستاگلاندین را متوقف میکنند و اثر ضد دردی خوبی روی گرفتگی های عضلانی از خود نشان داده اند. با این حال استفاده از این داروها عوارض جانبی خاص خود را دارند ، پس با مشورت و طبق دستور دکتر خود استفاده کنید تا مطمئن شوید این داروها درمان خوبی برای شما هستند یا نه.

همچنین شواهد زیادی برای راه های درمانی غیردارویی درد هم وجود دارد. گرما (مثلا گرمای پدهای گرم کننده یا پوشانیدن خود) هم اثرات مفید خود را برای رهایی از درد نشان داده، علاوه بر این موارد ، گیاهان دارویی ، ورزش ، تغییر رژیم غذایی و طب سوزنی هم مورد مطالعه قرار گرفته اند.نتایج قابل قبولی مشاهده شده اما تحقیقات بیشتری لازم است.

    درد سینه ها: سینه ها بخاطر احتباس آب دردناک هستند. درد سینه یک درد شایع در زمان پیش از قاعدگی است. درد معمولا منتشر شونده است و در هر دو سینه حس می شود. افزایش مقدار آب بخاطر تغییر سطح هورمون یک دلیل احتمالی است.

راه حل

پوشیدن یک سوتین مناسب و استفاده از کرم های موضعی ضد التهابی و مسکن (غیر استروئیدی) راه های شایعی برای کنترل درد سینه هستند.`;
export const MORE_ABOUT_MOOD = `حال عمومی



حال عمومی در اصطلاح به حالت روانی فرد اشاره دارد. با اینکه گروه های زیادی از حالات روانی وجود دارد، اما هستند حالاتی که به طور مکرر و روزانه با چرخه قاعدگی ارتباط دارند .

دو هورمون استروژن و پروژسترون ، که نقش غالبی در تنظیم چرخه قاعدگی دارند ، میتوانند بر روی عملکرد ادراکی و حالات روانی شما نیز تاثیر بذارند.
این تفکر که شما در فاز پیش از قاعدگی ممکن است بدخلق ، مضطرب و افسرده باشید از لحاظ فرهنگی تفکر فراگیری است ، اما رابطه ی بین خلق وخو و چرخه ی قاعدگی  آنقدر ها هم یک جانبه و سطحی نیست.درست است که بعضی افراد حال و هوای بدی را در فاز پیش از قاعدگی تجربه میکنند (و حتی  بعضی تا حد شدیدی از آن را تجربه میکنند)، هستند افرادی هم که احساسات و خلق و خوی خوب را گزارش کرده اند. جالب است بدانید سلامت جسمانی، استرس و حمایت های عاطفی نسبت به چرخه قاعدگی عوامل موثرتری، برای تغییر خلق و خوی هستند.

استرس و چرخه قاعدگی رابطه ای پیچیده بر هم دارند. استرس می تواند روی چرخه قاعدگی تاثیرگذار باشد و برعکس ، ابعاد خاصی از چرخه قاعدگی نیز میتوانند روی سطح استرس تاثیر بذارند.



مشکلات روانی زمینه ای‎



مشکلات سلامت روانی که از قبل یا به طور زمینه ای در فرد وجود دارند هم میتوانند در فاز پیش از قاعدگی تشدید شوند. وقتی که علائم این مشکلات موجود در فاز پیش از قاعدگی تشدید می شوند ، از اصطلاح " تشدید پیش از قاعدگی" استفاده میشود. علائم ناشی از حالات روانی تشدید شده از جمله افسردگی و اضطراب، بعضا میتوانند با علائم روانی قاعدگی همزمان شده و یا با آن اشتباه گرفته شود.

ردیابی حال و هوای روزانه در تشخیص تغییرات عود کننده در چرخه ی قاعدگی ، به شما کمک بسیاری می کند. همچنین کیفیت جنبه های مهم دیگر زندگی (مثل  خواب ، استرس و حمایت خانواده و دوستان)که روی حال و هوای شما تاثیر گذارند را برایتان آشکار تر می کنند.


چرا باید این موارد را پی گیری کرد؟



خستگی و کوفتگی ، احساسات ، شرایط روانی ، همگی موضوعات شایع گزارش شده در فاز پیش از قاعدگی است.ردیابی حال عمومی در طول چرخه هورمونی در تشخیص اینکه آیا این تغییرات باعث تغییر بخشی از الگوی هورمونی چرخه ی شما میشود ، به شما کمک میکند. البته باید سایر عواملی که ممکن است روی حال عمومی شما موثر باشند مثل استرس، رژیم غذایی، خواب ،سلامت روانی، ورزش و مریضی را هم در نظر بگیرید.



شاد و بانشاط



به معنای خوش رو و راضی بودن
مشغول، متهعد، مصمم و دارای توجه

       برخلاف تصور شایع که  بدخلقی و فاز قبل از قاعدگی برای همه ی افراد ، با هم همراه هستند ، بعضی افراد حال و احوال خوب و خوش خلقی را همراه با چرخه ی خود تجربه میکنند.شما در حال جست وجوی الگوی حاکم بین خلق و خو و چرخه ی هورمونی خود هستید ، پس پیگیری حال هر روز خود چه خوب و چه بد ، هردو مهم است‌.


هیجان زده و عصبی



برانگیخته و هیجان زده بوده و احساس میکنید تحت فشار هستید.

رابطه بین استرس و چرخه قاعدگی،رابطه پیچیده ای است.استرس میتواند معانی مختلفی برای افراد متفاوت داشته باشد و از قسمت های مختلفی از زندگی فرد سرچشمه میگیرد(شامل روابط عاطفی، دوستان،خانواده،کار و محل تحصیل).استرس جنبه های مختلفی از چرخه قاعدگی را تحت تاثیر قرار می دهد ؛ مثل طول چرخه یا حجم جریان قاعدگی. همچنین استرس میتواند علائم خلق و خوی پیش از قاعدگی ،سندرم پیش از قاعدگی یا سایر مشکلات خلق و خویی مربوط به قاعدگی را همراهی کند. همچنین استرس میتواند توانایی تمرکز و یادگیری را مختل کند‌.


غمگین و خسته



خسته و کوفته ، به سختی میتوانید کارهایتان را انجام دهید.

احساس غم و ناراحتی می کنید ، حساسیت عاطفی و تمایل به گریه کردن دارید.

در زمینه ی چرخه ی قاعدگی، احساس خستگی و کوفتگی بسیار ذکر میشود و یکی از علائم شایع گزارش شده در فاز پیش از قاعدگی است . کوفتگی در حین رسیدن به بلوغ، بارداری، خونریزی پس از زایمان و یائسگی هم به وفور گزارش میشود.

بعضی افراد گریه ی بدون کنترل و احساس افسردگی ، اضطراب ، نگرانی و احساس غم و غصه داشتن را در فاز قبل از قاعدگی گزارش کرده اند. اگر شما در حدی ناراحتی را حس میکنید که زندگی روزانه  و روابط شما مختل میشوند ، شاید زمان خوبی است که با پزشک خود صحبت کنید.

مشکلات سلامت روانی موجود مثل اضطراب و افسردگی هم  میتوانند در فاز پیش از قاعدگی تشدید شوند. وقتی که علائم مشکلات موجود در فاز پیش از قاعدگی تشدید می شوند ، از اصطلاح " تشدید پیش از قاعدگی " استفاده میشود.


سندروم پیش از قاعدگی



سندرم پیش از قاعدگی (PMS) یک الگوی تشدید شونده از تغییرات احساسی، فیزیکی، و رفتاری در روزهای پیش از قاعدگی است.

یک سری علائم فیزیکی ، رفتاری و خلقی شایع وجود دارند که قبل و در حین پریود عود میکنند.دردهایی مثل درد بدن ، درد سینه و سردرد ، شایع هستند. تخمین ها متفاوت است ، اما 20 تا 32 درصد افرادی که قاعدگی دارند سندرم پیش از قاعدگی خفیف و 3 تا 8 درصد افراد سندرم پیش از قاعدگی شدید را تجربه میکنند. آمار ها پریود همراه با درد ، که در پزشکی قاعدگی دردناک نامیده میشود ، بین 16 تا 81 درصد نشان داده اند.

حدودا 80 درصد افراد می گویند که یک یا بیشتر از یک علامت پیش از قاعدگی را تجربه میکنند و 20 تا 32 درصد افراد می گویند که علائم آنها انقدر محسوس هستند که زندگی روزانه ی آنها تحت تاثیر آنها قرار میگیرد. با اینکه این سندرم، یک موضوع خیلی معمولی و شایع است‌‌ ،‌ جامعه ی پزشکی موضع صریحی درمورد دلیل دقیق وقوع این سندرم ندارد.

تجربه ی شخصی هر فرد از سندرم پیش از قاعدگی در شدت ، طول مدت و انواع علامت ها متفاوت و خاص است. شما تا هر درجه ای که از PMS را تجربه کرده اید، زمان وقوع و مجوعه ی علامت های شما معمولا همیشه ثابت است ، اما شدت آنها در هر چرخه می تواند متفاوت باشد. فاکتور هایی مثل رژیم غذایی، کافئین، استرس و اضطراب، افزایش سن و افسردگی میتوانند شدت علائم شما را افزایش دهند.



شاخص و نشانه ها



بیشتر از 150 علامت به PMS منسوب میشوند. اما شایع ترین این علائم موارد زیر هستند :

سردرد و میگرن

درد سینه، تورم و حساسیت به لمس شدن

نفخ ، احتباس آب و افزایش وزن

یبوست و حالت تهوع

اضطراب، گریه جوئی ، پریشان حالی و افزایش حساسیت

مشکلات خواب، آکنه و یا ولع برای غذا


باید دکترتان را ملاقات کنید اگر...



علائم احساسی یا فیزیکی سندرم پیش از قاعدگی برای شما غیرقابل کنترل هستند و اثری منفی روی روابط شما با دیگران یا سلامت شخصی شما دارند.

روش های تسکینی:


راه های زیادی برای کنترل علائم این سندرم وجود دارد ، اما پیدا کردن موثر ترین راه برای مقابله با PMS به جست و جوی هر فرد بستگی دارد.

بکارگیری روش های تن آرامی و مثبت اندیشی

عبادت کردن و شکر گزاری

کاهش یا قطع مصرف کافئین

داروهای مسکن بدون نسخه مثل ایبو پروفن

کیسه های آب گرم، کمپرس های گرم، یا پد های گرمایشی برای درد

استراحت

حتی هورمون های استروژن و پروژسترون علاوه بر تنظیم چرخه قاعدگی بر روی عملکرد ادراکی و حالات روانی نیز موثر باشند. با این وجود بازهم این شما هستید که حال خوب روزهای خود را می سازید و با تصمیم های خوب،مشورت کردن، ورزش، شکرگزاری و عبادت می توانید بر شرایط هورمونی خود تسلط یابید. چرا که این شما و اراده ی شماست که بر همه این عوامل غلبه خواهد کرد و هورمونها تنها بخش کوچکی از جهان درون شما هستند.`;
export const MORE_ABOUT_SLEEP = `خواب

خواب کافی و با کیفیت بخشی ضروری از یک سبک زندگی سالم و مفید است.

به نظر می رسد که چرخه ی خواب و بیداری 24 ساعته ، با بالا رفتن و افت سطح هورمون های استروژن و پروژسترون، که چرخه قاعدگی را تنظیم می کنند، می تواند بر توانایی خانم ها در خوابیدن و همچنین کیفیت خواب او تاثیر بگذارند.

شواهدی مبنی بر اختلال چرخه ی خواب و بیداری بخاطر شیفت شبانه، بی خوابی مزمن ، یا سفر درمنطقه های زمانی ، روی  خصوصیات و مشخصات چرخه ی قاعدگی تاثیر می گذارد ، و باعث نامنظم شدن چرخه ی قاعدگی و طولانی تر شدن چرخه ها و تاخیر پریود میشود.

در طول فاز پیش از قاعدگی ، علائم دردی مثل گرفتگی عضلات، نفخ و سردرد به عنوان مختل کننده های خواب گزارش شده اند. افراد دارای سندرم پیش از قاعدگی (PMS) واختلال افسردگی پیش از قاعدگی (PMDD) از اختلال خواب محسوسی که ناشی از کوفتگی، بیماری بی خوابی، خواب زدگی، خواب آلودگی در طول روز، و خواب های آزاد دهنده است گزارش میدهند.

اختلال خواب در طول بارداری هم بسیار شایع است. علائم فیزیکی ای مثل دفعات بالای نیاز به ادرار کردن، درد بدن ، گرفتگی عضلانی و سوزش قلب معمولا موجب اختلال خواب هستند.هم چنین ، گر گرفتگی و تعریق شبانه در دوران یائسگی شایع هستند و میتوانند دلیل بی خوابی های شبانه باشند.

بررسی میزان خواب میتواند در تشخیص تغییر کیفیت خواب شما در طول چرخه قاعدگی یا شرایطی مثل بارداری و یائسگی به شما کمک کند.

خواب با کیفیت پایین در خانم هایی که...

    قاعدگی نامنظم دارند.
    سندرم تخمدان پلی کیستیک دارند.
    زنانی که دیسمنوره(قاعدگی دردناک) دارند.

دیده می شود.

خواب متعادل در بین افراد مختلف ، متفاوت است.


راه هایی برای کمک به خوابیدن و خواب باکیفیت:

اگر خوابتان نمی برد سعی کنید از رختخواب خارج شوید و کار دیگری انجام دهید مانند خواندن کتاب یا پیاده روی در خانه.

وقتی خوابتان می آید و در رختخواب دراز می کشید به صفحه نمایش موبایل و یا تلویزیون نگاه نکنید. زیرا نورآبی این صفحه نمایش ها بدن را بیدار نگه میدارد و بر ریتم شبانه روزی و طبیعی شما اثر می گذارد.

در صورت بی خوابی از تماشای ساعت خودداری کنید و با دیدن ساعت به خودتان استرس ندهید.  

نوشتن افکار، نگرانی ها و یا حتی لیست شکرگزاری از خداوند مهربان می تواند به شما کمک کند افکار منفی را دور کنید و به تصمیم های بهتر در آینده امیدوار باشید.

نور اتاق خواب را کم کنید و سعی کنید از چراغ خواب های ملایم استفاده کنید.

از مصرف کافئین در حداقل 6 ساعت قبل از خواب خودداری کنید.

ورزش به طورمرتب کیفیت کلی خواب را بهبود می بخشد، اما خیلی نزدیک به زمان خواب ورزش نکنید، زیرا ممکن است باعث بی خوابی شما شود.

تحقیقات نشان داده است که دعا و عبادت کردن پروردگار یکی از موثر ترین روش های تمدد اعصاب ، دوری از فشار روانی و بهره مندی از خواب آرام است.

 

علائم لازم به پی گیری :

    چندین بار در طول هفته ، بین خواب، بیدار میشوید ، معمولا بیش از چند دقیقه طول میکشید تا دوباره به خواب بروید و یا برای چندین ماه است که از بی خوابی رنج میبرید.
    متوجه میشوید که زمان متوسط خوابیدن شما به صورت محسوسی افزایش یا کاهش پیدا کرده است.


`;
export const MORE_ABOUT_EXCERSICE = `ورزش

ورزش به هر نوع فعالیت فیزیکی قصدی گفته میشود که باعث پیشرفت تناسب اندام میشود. منفعت های سلامتی مربوط به ورزش بیشمار هستند. همچنین ورزش باعث کاهش بسیاری از ریسک های سلامتی ناشی از بیماری ها میشود و با ریسک افسردگی کمتر، کیفیت خواب بهتر، چگالی استخوانی بهتر و غیره همراه است.
چرا باید ورزش را دنبال کرد

بهتر است بدانید ورزش کردن بر روی چرخه قاعدگی موثر است. شدت و مدت فعالیت فیزیکی دو فاکتور مهم در تعیین نحوه تاثیر ورزش بر روی چرخه قاعدگی شما هستند.

مقاومت فیزیکی تحت تاثیر هورمون های استروژن و پروژسترون است زیرا این هورمون های دمای بدن، متابولیسم، و عملکرد قلب را تنظیم میکنند.

هورمون های ما همچنین خاصیت ارتجاعی رباط های بدن را تغییر میدهند. افرادی که بصورت منظم ورزش میکنند از  ریسک کمتری برای مشکلات قلبی، دیابت افراد بالغ و سرطان های دستگاه تولید مثل برخوردار هستند.

ورزش معتدل و منظم به عنوان یک استراتژی درمان برای کاهش درد و علائم منفی چرخه قاعدگی پیشنهاد میشوند.

با این حال، ورزش سنگین میتواند باعث نامنظم شدن چرخه قاعدگی شود. شدید ترین علامتی که ممکن است ایجاد شود، از دست رفتن پریود  (که در اصطلاحات پزشکی به آن آمنوره می گویند) در ورزشکاران در سطح قهرمانی است. یک تحقیق تازه نشان داده است که ورزش سنگین مکرر ممکن است باعث نامنظمی بیشتری نسبت به چیزی باشد که تصور میشد. پیگیری ورزش از طریق نرم افزار میتواند زمینه مهمی برای تفسیر ویژگی های غیرمعمول چرخه قاعدگی را برای شما فراهم کند.
همه چیز رو به راه است:

 افراد بالغ و سالم در محدوده سنی ۱۸ تا ۶۵ سال نیازمند انجام فعالیت های فیزیکی هوازی متعادل برای حداقل۳۰دقیقه و ۵ روز در هر هفته ،یا فعالیت های فیزیکی هوازی زورمند و قوی برای حداقل ۲۰ دقیقه در ۳ روز از هر هفته هستند.

افراد در حال بلوغ سالم در محدوده سنی ۱۴ تا ۱۷ سال نیازمند حداقل ۶۰ دقیقه فعالیت فیزیکی از متعادل تا شدید در بیشتر روزها هستند.


باید به پزشک مراجعه کنید:

    اگر ورزش سنگین انجام میدهید و در نتیجه ۳ دوره خونریزی پریود خود را از دست داده اید!

انواع ورزش ها

دویدن: منظور ما از این گزینه ، آهسته دویدن، دو سرعت و سریع راه رفتن است.

دویدن به صورت سرگرمی منجر به کنترل وزن بهتر میشود. از آنجایی که هورمون ها روی خاصیت ارتجاعی رباط ها تاثیرگذارند،ارزش این را دارد که توجه خاصی (در نیمه دوم چرخه قاعدگی ، از تخمک گذاری تا آغاز پریود بعدی) نسبت به گرم کردن و نرمش های کششی مناسب در فاز لوتئال داشته باشید.

  

باشگاه: منظور ما کلاس های ورزش ، بدنسازی و یا حتی دوچرخه سواری است.

تحقیقات نشان داده است که افزایش دادن زمان کار با ابزارهای ورزشی با کاهش روند افزایش وزن نسبت مستقیم دارد. سطح مقاومت در دوچرخه سواری میتواند در طول چرخه قاعدگی تغییر کند ، چون هورمون ها روی خاصیت ارتجاعی رباط ها تاثیر گذارند.

نرمش: شامل یک سری ورزش های تنفسی، کششی و تعادلی مانند پیلاتس , با هدف رسیدن به آرامش جسمانی و ریلکسیشن

تحقیقات نشان داده که این نوع ورزش ها میتوانند ضداسترس و ضدافسردگی باشند‌. اگر از مشکلات خلقی در طول دوره های قاعدگی رنج می برید می توانید از این نوع حرکات ورزشی برای بهبود شرایط روانی خود بهره ببرید.

شنا: شامل شنای یک طول استخر و سایر ورزشهای آبی

شنای عادی یک روش عالی برای ورزش کردن, بدون وارد کردن فشاربر روی زانو ها و کمر است.طول مدت و شدت ورزش میتواند بخاطر تغییرات خاصیت ارتجاعی رباط ها در شرایط مختلف چرخه هورمونی، تغییر کند.
بدن شما منحصر به فرد است

انسان ها با هم متفاوت هستند. همینطور تفاوت در دوره های شما با هم چیزی طبیعی است. مقایسه ی چرخه ی خودتان با دیگران ممکن است شما را به این فکر بیاندازد که یک مشکل وجود دارد، در حالی که احتمالا همه چیز درست است.بهتر است که وقتی متوجه موضوعی غیرمعمول در چرخه ی خودتان میشوید ، یا میخواهید بدانید که چرا وضع چرخه ی قاعدگی شما با میزان متعارف و طبیعی متفاوت است ، به پزشکتان مراجعه کنید.
Like
Be the first to like this`;
export const MORE_ABOUT_SEX = `همسرانگی:

همسرانگی یا رابطه جنسی ممکن است شامل انواع فعالیت ها از جمله: رابطه واژنی، رابطه مقعدی، رابطه دهانی و... باشد.

نوع رابطه جنسی در طی سیکل ماهانه تغییر میکند. ممکن است احساس خوبی که در روز 14 چرخه ماهانه دارید با روز 26 چرخه ماهانه متفاوت باشد که این تغییرات طبیعی و در نتیجه ی پاسخ به هورمون های تولیدمثل اتفاق می افتد.
چرا باید همسرانگی را دنبال کنیم؟

ما در نرم افزار پرتو البته با کمک شما و اطلاعات دقیقی که از طول مدت پریودی در اختیار ما می گذارید؛ تاریخ تخمک گذاری و یا شانس باروری را تخمین می زنیم.

همچنین کیت های تخمک گذاری و اطلاعاتی راجع به دمای بدن در تخمین محدوده ی تخمک گذاری و باروری به شما کمک میکند.

لازم است هر خانمی اطلاعاتی در ارتباط با زمان تخمک گذاری داشته باشد زیرا اگر قصد بارداری داشته باشید، باید در این زمان اقدام کنید همچنین اگر قصد پیشگیری از بارداری را دارید در تاریخی که تخمک گذاری تخمین زده شده باید هنگام رابطه جنسی موارد احتیاط جهت پیشگیری از بارداری را رعایت کنید.

شاید تصور کنید روش های پیشگیری از بارداری می تواند روی رابطه ی جنسی و همسرانگی شما تاثیرگذار باشد. برای مثال: احساس مصونیت از بارداری رغبت شما به رابطه ی جنسی را افزایش دهد ولی بعضی تحقیقات نشان داده است که با استفاده از داروهای ضدبارداری تمایل و لذت جنسی کاهش می یابد.

میل جنسی تحت تاثیر هورمون هایی است که در طول چرخه ماهانه دچار نوسان می شوند مانند: استروژن و پروژسترون.

اگر به چرخه ی ماهانه خود توجه کنید متوجه می شوید که میل جنسی در روزهای نزدیک به تخمک گذاری افزایش می یابد و چند روز بعد از تخمک گذاری کاهش می یابد.طبق تحقیقات برخی افراد رضایت بیشتری از ارگاسم در این بازه ی زمانی را تجربه کرده اند.البته این نتایج در همه ی افراد یکسان نمی باشد زیرا بعضی از افراد میل جنسی بیشتری را در روزهای نزدیک به قاعدگی گزارش کرده اند.شما هم با پیگیری روابط جنسی متوجه می شوید چه محدوده ای برای شما نرمال است.

از طرفی ترشحات لغزنده ی طبیعی شما با نزدیک شدن به زمان تخمک گذاری افزایش می یابد که می تواند روی میل جنسی شما موثر باشد.

  

مراجعه به پزشک در صورت :

    درد و لکه بینی حین نزدیکی یا بعد از آن
    در صورتی که بعد از نزدیکی متوجه زخم یا ترشحات غیرطبیعی شوید.

انواع رابطه جنسی:

    رابطه حفاظت نشده: یک رابطه با همسرتان که میتواند شامل نزدیکی از واژن  بوده و بدون استفاده از روش های پیشگیری از بارداری صورت میگیرد .
    رابطه حفاظت شده: یک رابطه با همسرتان که میتواند شامل نزدیکی واژنی، مقعدی یا رابطه ی دهانی باشد و در آن از ابزارهای محافظت بهداشتی یا داروهای پیشگیری از بارداری استفاده میشود. راه های پیشگیری از بارداری هورمونی شامل روش هایی مثل مصرف قرص ، آمپول ، IUD و ... میشود. کاندوم تنها راه پیشگیری از بارداری است که میتواند جلوی انتقال عفونت های منتقله از راه جنسی را نیز بگیرد.   یکی دیگر از راه های پیشگیری عقب نشینی ، با عنوان های متد خارج کردن و قطع مقاربت نیز شناخته میشود. این روش نیازمند این است که شریک جنسی شما کنترل خوبی روی خودش داشته باشد، همچنین به اعتماد زیادی نیازمند است. در مایع پیشاب هر 3 مرد از 10 مرد، اسپرم مشاهده میشود ، پس امکان بارداری وجود دارد.تحقیقات نشان میدهند که اگر زوج ها روش عقب نشینی را تمرین کنند، در یک سال ، احتمال حاملگی به 20تا30درصد میرسد. پیگیری رابطه ی جنسی میتواند به شما کمک کند تا درمورد فعالیت جنسی خود و باردار شدن در حوالی تخمک گذاری تصمیم گیری کنید.



خطرات احتمالی رابطه مقعدی

    خونریزی مقعد
    انتقال ایدز
    سرطان مقعد
    درد شدید مقعدی برای زنان
    بیماریهای عفونی
    آسیب به مقعد
    بی اختیاری مدفوع
    احتمال سوراخ شدن روده ها
    سرد مزاجی در خانم‌ها
    افزایش خطر ابتلا به ویروس پاپیلومای انسانی (( HPV و از طرفی HPV ممکن است منجر به ایجاد زگیل مقعد و سرطان مقعد شود.
    از آنجا که دهانه مقعد دارای ماهیچه ای حلقوی است، مانند یک کش محکم دور آلت مرد را گرفته و در لحظه خروج منی مانند یک سد عمل می کند. و در اثر این عمل احتمال پس زدن منی به عقب و فشار به کیسه های منی و غده پروستات و عوارض ناشی از آن خیلی زیاد است.


اقدام به بارداری:

قبل از اقدام به بارداری استرس و اضطراب رو از خود و همسرتان دور کنید چون استرس باعث دیربارور شدن و ناباروری می‌شود.

با خیالی آسوده با همسرتان در مورد بچه‌دار شدن و پذیرفتن نقش مادر و نقش پدری صحبت کنید.

در صورت پذیرش هر دوطرف و تصمیم به بارداری ۳ماه قبل از اقدام به بارداری به پزشک زنان یا ماما مراجعه کنید تا آزمایش‌های روتین قبل از بارداری را انجام دهید و توسط پزشک یا ماما معاینه شوید.اگر داروی خاصی استفاده می‌کنید یا بیماری خاصی از جمله:دیابت، فشارخون، سقط مکرر و... دارید به پزشک خود اطلاع دهید و اجازه دهید پزشک با توجه به آزمایشات و معاینه بالینی اجازه بارداری را به شما بدهد و سپس بدن را برای بارداری سالم و طبیعی آماده کنید.

    اضافه وزن احتمال باردار شدن شما را کم می کند.
    کاهش وزن شدید نیز باعث دوره های قاعدگی نامنظم و در نتیجه کاهش احتمال حاملگی می شود.
    داشتن یک رژیم غذایی مناسب قبل از بارداری کمک چشم گیری به شما خواهد کرد.
    اگر دندان خراب دارید یا پوسیدگی مختصری دارد حتماً قبل از بارداری اقدام به ترمیم آن کنید.
    بعد از اجازه بارداری توسط پزشک راه‌های پیشگیری از بارداری را کنار بگذارید و طبق دستور پزشک اسیدفولیک مصرف کنید.
    در صورتی که از موادمخدر، سیگار، قلیان، الکل استفاده می‌کنید برای بارداری سالم و فرزند سالم باید مصرف را قطع کنید.‌

بهترین زمان برای باروری که شانس بیشتری برای باردار شدن دارید زمان تخمک گذاری می‌باشد.زمان تخمک گذاری یک یا چند تخمک از تخمدان زنان جدا می شود و بهترین شرایط و زمان مناسب برای لقاح به وجود می آید. می‌توانید با استفاده از نرم افزار پرتو و یا کیت‌های تخمک‌گذاری محدوده‌ی زمانی تخمک‌گذاری را مشخص کنید و دو روز قبل از تخمک‌گذاری تا دو روز بعد از آن نزدیکی داشته باشید.

علائم بارداری:

در حالی که آزمایشات بارداری و سونوگرافی تنها راه تشخیص باردار بودن است ، اما علائم و نشانه های دیگری وجود دارد که می توانید به آنها توجه کنید. اولین علائم بارداری قطع پریودی می‌باشد.همچنین ممکن است شامل تهوع صبحگاهی ، حساسیت به بو و خستگی باشد.

برخی علائم بارداری تا ۱۲هفتگی:

    گرفتگی خفیف و لکه بینی
    خستگی
    تهوع
    سوزن سوزن شدن یا درد گرفتن سینه ها
    تکرر ادرار
    نفخ
    تغییرات دما
    درد زیر شکم
    حساسیت پستان‌ها
`;
