export const main_notifications = {
  WEEK_5:
    'عزیزم وارد هفته‌ی ۵ بارداری شدی! از قسمت مقالات، مطالعه مقاله مربوط به هفته‌ی پنجم بارداری رو فراموش نکن.',
  WEEK_6:
    'عزیزم وارد هفته‌ی ۶ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی ششم بارداری رو مطالعه کن.',
  WEEK_7:
    'عزیزم وارد هفته‌ی ۷ بارداری شدی! سه ماهه‌ی اول، تو مصرف داروها و مواد آرایشی خیلی خیلی محتاط باش!',

  WEEK_8:
    'عزیزم وارد هفته‌ی ۸ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی هشتم بارداری رو مطالعه کن.',

  WEEK_9:
    'عزیزم وارد هفته‌ی ۹ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی نهم بارداری رو مطالعه کن.',

  WEEK_10:
    'عزیزم وارد هفته‌ی ۱۰ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی دهم بارداری رو مطالعه کن.',

  WEEK_11:
    'عزیزم وارد هفته‌ی ۱۱ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی یازدهم بارداری رو مطالعه کن.',

  WEEK_12:
    'عزیزم وارد هفته‌ی ۱۲ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی دوازدهم بارداری رو مطالعه کن.',

  WEEK_13:
    'عزیزم وارد هفته‌ی ۱۳ بارداری شدی! از قسمت مقالات، مقاله مربوط به هفته‌ی سیزدهم بارداری رو مطالعه کن.',

  WEEK_14:
    'تبریک تبریک مامان عزیز! وارد هفته‌ی ۱۴ و سه ماهه دوم بارداری شدی. روزهای شاد و پرانرژی در راهه.',

  WEEK_15:
    'مامان عزیز! وارد هفته‌ی ۱۵ بارداری شدی. مقاله‌ی هفته‌ی پانزدهم رو خوندی؟',

  WEEK_16:
    'مامان عزیز! وارد هفته‌ی ۱۶ بارداری شدی. مقاله‌ی هفته‌ی شانزدهم رو خوندی؟',

  WEEK_17:
    'مامان عزیز! وارد هفته‌ی ۱۷ بارداری شدی. مقاله‌ی هفته‌ی هفدهم رو خوندی؟',

  WEEK_18:
    'مامان عزیز! وارد هفته‌ی ۱۸ بارداری شدی. مقاله هفته‌ی هجدهم رو از دست نده.',

  WEEK_19:
    'مامان عزیز! وارد هفته‌ی ۱۹ بارداری شدی! مقاله هفته‌ی نوزدهم رو از دست نده.',

  WEEK_20:
    'بریک تبریک مامان عزیز! وارد هفته‌ی ۲۰ بارداری شدی و به نیمه‌ی راه رسیدی. از هر لحظه‌ی این روزهای ناب لذت ببر و خدا رو بخاطر همه‌ی محبتاش شکر کن!',

  WEEK_21:
    'مامان عزیز! وارد هفته‌ی ۲۱ بارداری شدی و این فسقلی به سرعت درحال رشد کردنه. مقاله هفته‌ی بیست و یکم رو از دست نده.',

  WEEK_22:
    'مامان عزیز! وارد هفته‌ی ۲۲بارداری شدی. مقاله هفته‌ی بیست و دوم رو از دست نده.',

  WEEK_23:
    'مامان عزیز! وارد هفته‌ی ۱۶ بارداری شدی. از قسمت مقالات، مقاله مربوط به هفته‌ی بیست و سوم بارداری رو مطالعه کن.',

  WEEK_24:
    'مامان عزیز! وارد هفته‌ی ۲۴ بارداری شدی. از قسمت مقالات، مقاله مربوط به هفته‌ی بیست و چهارم بارداری رو مطالعه کن.',

  WEEK_25:
    'مامان عزیز! وارد هفته‌ی ۲۵ بارداری شدی. از قسمت مقالات، مقاله مربوط به هفته‌ی بیست و پنجم بارداری رو مطالعه کن.',

  WEEK_26:
    'مامان عزیز! وارد هفته‌ی ۲۶ بارداری شدی. از قسمت مقالات، مقاله مربوط به هفته‌ی بیست و ششم بارداری رو مطالعه کن.',

  WEEK_27:
    'مامان عزیز! وارد هفته‌ی ۲۷ بارداری شدی. از قسمت مقالات، مقاله مربوط به هفته‌ی بیست و هفتم بارداری رو مطالعه کن.',

  WEEK_28:
    'تبریک تبریک مامان عزیز! وارد هفته‌ی ۲۸ و سه ماهه سوم بارداری شدی. تا الان عالی بودی، تا آخرش هم عالی خواهی بود.',

  WEEK_29:
    'مامان عزیز! وارد هفته‌ی ۲۹ بارداری شدی. همه چیز به سرعت در حال سپری شدنه! مقاله‌ی هفته‌ی بیست و نهم رو فراموش نکنی !',

  WEEK_30:
    'مامان عزیز! وارد هفته‌ی ۳۰ بارداری شدی. مقاله هفته‌ی سی‌ام رو از دست نده.',

  WEEK_31:
    'مامان عزیز! وارد هفته‌ی ۳۱بارداری شدی. مقاله هفته‌ی سی و یکم رو از دست نده.',

  WEEK_32:
    'مامان عزیز! وارد هفته‌ی ۳۲ بارداری شدی. مقاله هفته‌ی سی و دوم رو از دست نده.',

  WEEK_33:
    'مامان عزیز! وارد هفته‌ی ۳۳ بارداری شدی. مقاله هفته‌ی سی و سوم رو از دست نده.',

  WEEK_34:
    'مامان عزیز! وارد هفته‌ی ۳۴ بارداری شدی. مقاله هفته‌ی سی و چهارم رو خوندی؟',

  WEEK_35:
    'مامان عزیز! وارد هفته‌ی ۳۵ بارداری شدی. مقاله هفته‌ی سی و پنجم رو خوندی؟',

  WEEK_36:
    'مامان عزیز! وارد هفته‌ی ۳۶ بارداری شدی. مقاله هفته‌ی سی و ششم رو خوندی؟',

  WEEK_37:
    'مامان عزیز! وارد هفته‌ی ۳۷ بارداری شدی. مقاله هفته‌ی سی و هفتم رو خوندی؟',

  WEEK_38:
    'مامان عزیز تبریک! وارد هفته‌ی ۳۸ بارداری شدی. دیگه چیزی به رسیدن مسافر کوچولو نمونده.',

  WEEK_39:
    'مامان عزیز! وارد هفته‌ی ۳۹ بارداری شدی. مراقب تکون‌های نی‌نی باش و مقاله‌ی هفته‌ی سی و نه رو حتما بخون.',

  WEEK_40:
    'مامان عزیز! وارد هفته‌ی ۴۰ بارداری شدی. این هفته معجزه خدا رو خواهی دید. به مقالات پرتو سر بزن!',

  WEEK_41:
    'مامان عزیز! وارد هفته‌ی ۴۱ بارداری شدی. مقاله هفته‌ی چهل و یکم رو از دست نده.',

  WEEK_42:
    'مامان عزیز! وارد هفته‌ی ۴۲ بارداری شدی. مقاله هفته‌ی چهل و دوم رو از دست نده.',
};
export const partner_notifications = {
  WEEK_5:
    'شروع هفته‌ی ۵ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی پنجم بارداری رو مطالعه کن.',

  WEEK_6:
    'شروع هفته‌ی ۶ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی ششم بارداری رو مطالعه کن.',

  WEEK_7:
    'شروع هفته‌ی ۷ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی هفتم بارداری رو مطالعه کن.',

  WEEK_8:
    'ورود به هفته‌ی ۸ بارداری! از این هفته به بعد سونوگرافی قلب جنین انجام میشه. به مقاله هفته هشتم بارداری مراجعه کن.',

  WEEK_9:
    'ورود به هفته‌ی ۹ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی نهم بارداری رو مطالعه کن.',

  WEEK_10:
    'ورود به هفته‌ی ۱۰ بارداری! خیلی از خانم‌ها این روزا از ویار شدید رنج می‌برند. از قسمت مقالات، مقاله مربوط به هفته‌ی دهم بارداری رو مطالعه کن.',

  WEEK_11:
    'شروع هفته ی ۱۱ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی یازدهم بارداری رو مطالعه کن.',

  WEEK_12:
    'شروع هفته‌ی ۱۲ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی دوازدهم بارداری رو مطالعه کن.',

  WEEK_13:
    'شروع هفته‌ی ۱۳ بارداری! از قسمت مقالات، مقاله مربوط به هفته‌ی سیزدهم بارداری رو مطالعه کن.',

  WEEK_14:
    'تبریک تبریک! وارد هفته‌ی ۱۴ و سه ماهه دوم بارداری شدید. روزهای شاد و پرانرژی در راهه.',

  WEEK_15:
    'بابای عزیز! وارد هفته‌ی ۱۵ و سه ماهه دوم بارداری شدید. مقاله‌ی هفته‌ی پانزدهم رو خوندی؟',

  WEEK_16:
    'بابای عزیز! وارد هفته‌ی ۱۶ و سه ماهه دوم بارداری شدید. . مقاله‌ی هفته‌ی شانزدهم رو خوندی؟',

  WEEK_17:
    'بابای عزیز! وارد هفته‌ی ۱۷ و سه ماهه دوم بارداری شدید. مقاله‌ی هفته‌ی هفدهم رو خوندی؟',
};
