export const HELP_TEXT =` محتوای این مجموعه ی فقهی با تلاش گروه علمی اداره پاسخگویی به سوالات دینی معاونت تبلیغات اسلامی آستان قدس رضوی در تیرماه سال 1399 تهیه و تدوین شده است.

در این محتوا می توانید احکام شرعی خود را در مورد خون های سه گانه ی زنان و نحوه ی تشخیص و تمایز آنها از یکدیگر را در بیانی روان ، ساده و علمی مطالعه کنید.

در این محتواها به تناسب نیازهای روز بانوان نکات کم کاربرد فقهی حذف شده و تاجای ممکن سعی شده که در خصوص موضوعات جدید و بیماری های مختلف زنان از مراجع بزرگ استفتاء صورت پذیرفته است.

بر اساس نظر چهار مرجع عالی قدر حضرت امام (ره) ، مقام معظم رهبری (مد)، آیت الله مکارم شیرازی و آیت الله سیستانی منایع و ارجاعات فقهی مرتبط با هر بخش در انتهای متن قابل مشاهده است.

گروه پرتو با افتخار سعی دارد با ارائه ی محتوای فقهی مورد نیاز خانم ها در زمینه ی خون های سه گانه آنها در آگاهی و تشخیص آسانتر مسیر عبادیشان یاری کند.

همراهی و حمایت شما پرتویی های به گروه پرتو برای تلاش در این مسیر انگیزه و انرژی می دهد.

`;


