import React, { useLayoutEffect } from 'react';
import { Text, ImageBackground, ScrollView } from 'react-native';

// components
import BackButton from '../../components/BackButton';
import Ptxt from '../../components/Ptxt';

// styles
import styles from './styles';

const TermsOfUse = ({ navigation }) => {
  useLayoutEffect(() => {
    navigation.setOptions({
      title: 'قوانین و مقررات',
      headerStyle: {
        elevation: 0,
      },
      headerLeft: () => null,
      headerRight: () => <BackButton navigation={navigation} />,
    });
  }, [navigation]);

  return (
    <ImageBackground
      source={require('../../../assets/images/about-us.png')}
      style={styles.bg}>
      <ScrollView style={{ marginBottom: 53 }}>
        <Text style={styles.question}>
          {'  '}
          استفاده از پرتو{' '}
        </Text>
        <Ptxt style={styles.txt}>
          • لازم است هر یک از کاربران با شماره و مشخصات خود در پرتو ثبت‌نام کرده
          باشند.
          {'\n'}• کاربران نسخه پرتوبانو می‌توانند از امکانات رایگان پرتو در بخش
          قاعدگی و بارداری استفاده کنند.
          {'\n'}• کاربران می‌توانند با اختیار خود اجازه دسترسی به اطلاعات قاعدگی
          و بارداری خود را از طریق نسخه همپر در اختیار فرد دیگری به‌عنوان همسر
          بگذارند؛ بنابراین کاربر موظف است از حریم شخصی خود از طریق کد همسر
          محافظت نماید و پرتو مسئولیتی در قبال سوءاستفاده افراد دیگر در
          بی‌مبالاتی در این مورد را بر عهده نخواهد گرفت.
          {'\n'}• مقالات ارائه شده صرفاً جنبه اطلاع‌رسانی داشته و به‌هیچ‌عنوان
          جایگزین تشخیص، تجویز و درمان پزشکی نخواهند بود.
        </Ptxt>
        <Text style={styles.question}>
          {'  '}
          گفت‌وگو با دستیار سلامت{' '}
        </Text>
        <Ptxt style={styles.txt}>
          • کاربر می‌تواند هر یک از بسته‌های موجود در کیف پول را خریداری کند و
          براساس تعداد گفتگوهای هر بسته، سؤالات خود را از بخش دستیار تغذیه یا
          دستیار مامایی بپرسد.
          {'\n'}• کاربر متعهد می‌شود سؤالات و مستندات ارسالی به کارشناس با رعایت
          موازین اسلامی و اخلاقی منطبق بوده. همچنین از به‌کاربردن کلمات
          غیرمتعارف و دور از اخلاق و ادب متعارف در گفت‌وگوی صوتی و متنی جدا
          خودداری کند! در غیر این صورت پرتو هیچ‌گونه مسئولیتی در جهت پاسخگویی و
          یا بازگرداندن مبلغ پرداختی کاربر نخواهد داشت.
          {'\n'}• در این نسخه تمام خدمات برنامه به‌جز مشاوره با کارشناسان رایگان
          می‌باشد.
          {'\n'}• در صورت بروز مشکل در هر یک از قسمت‌های پرداخت و مشاوره، کاربر
          می‌تواند در قسمت ارتباط با پرتو با کارشناسان ارتباط برقرار کند.
          {'\n'}• بهره‌گیری از خدمات دستیار تغذیه و مامایی صرفاً جنبه آگاهی‌بخشی
          و حمایت از سلامت کاربر را دارد؛ بنابراین هیچ‌گاه جایگزین مراجعه کاربر
          به پزشک و پیگیری‌های تخصصی و حضوری او نخواهد بود. .
        </Ptxt>
        <Text style={styles.question}>
          {'  '}
          کیف پول{' '}
        </Text>
        <Ptxt style={styles.txt}>
          • پرداخت هزینه چت با کارشناس از طریق درگاه‌های امن شاپرک انجام می‌شود.
          در صورت بروز هرگونه مشکل یا ابهام از طریق چت با پشتیبان و یا دیگر
          درگاه‌های ارتباطی، با پرتو ارتباط برقرار کنید.
          {'\n'}• اعتبار کیف پول مبلغی است که کاربران در حساب کاربری خوب
          به‌منظور استفاده از خدمات غیر رایگان پرتو بهره می‌برند. این مبلغ
          به‌صورت پرداخت از طریق درگاه پرداختی ارائه شده در نرم‌افزار پرتو طبق
          شرایط و قوانین حاضر منظور و محاسبه خواهد شد.
          {'\n'}• مبالغ پرداختی جهت فعال‌سازی بخش سوال از کارشناس قابل‌بازگشت
          نخواهد بود. در صورت هرگونه اعمال تغییر در خدمات غیر رایگان پرتو از سوی
          گروه پرتو اعتبار کیف پول برای استفاده از دیگر خدمات غیر رایگان
          قابل‌استفاده می‌باشد.
          {'\n'}• موجودی و اعتبار کیف پول کاربران و یا کدهای تخفیفی که به تأیید
          گروه نرم‌افزاری پرتو برای کاربران در نظر گرفته می‌شود صرفاً جهت
          استفاده از خدمات داخلی نرم‌افزار پرتو بوده و امکان دریافت این وجوه
          به‌صورت نقدی وجود ندارد.
          {'\n'}• کاربران می‌پذیرند کدهایی که جهت افزایش موجودی یا کاهش هزینه
          خدمات غیر رایگان پرتو به آنها داده می‌شود، ممکن است منقضی شود.
          ازآنجایی‌که پرتو برای ارائه کد ها، هزینه‌ای از کاربران دریافت نمی‌کند
          این حق برای آنها محفوظ است که مبلغ و یا درصد تأثیر این کد ها را تغییر
          داده و یا در صورت لزوم باطل کند. همچنین درصورتی‌که گروه پرتو تشخیص دهد
          اعمال این کد ها به علت خطای فنی یا تخلف صورت‌گرفته و یا غیرقانونی بوده
          باشد، می‌تواند این کدها و یا مبلغ موجودی را که در نتیجه استفاده از آن
          به‌حساب کاربر افزوده شده را باطل و یا حذف کند.
          {'\n'}• پرتو مغایرت در هزینه اعلامی و پرداخت شده را تنها در ۴۸ ساعت
          اولیه مورد بررسی قرار می‌دهد؛ بنابراین کاربران باید اعتراض خود را تا
          ۴۸ ساعت اولیه به پشتیبانی پرتو اعلام کنند.
        </Ptxt>
      </ScrollView>
    </ImageBackground>
  );
};
export default TermsOfUse;
